import noUserPhoto from '.././assets/user-img.png'

export const rules = `თამაშში მონაწილეობას იღებს 11 მოთამაშე, მათ შორის, 7 პატიოსანი მოქალაქე, 3 მაფიოზი და 1 მანიაკი.

🖤 ყოველ ღამე მაფია ირჩევს მსხვერპლს.

🖤 შემდეგ იღვიძებს მთავარი მაფიოზი - დონი და ეძებს დეტექტივს. დონს წამყვანი ჟესტიკულაციით ანიშნებს, მიაგნო, თუ არა მან დეტექტივს.

🕵🏻‍♂️ დონის შემდეგ იღვიძებს დეტექტივი და ეძებს მაფიოზებს.

🔪 დეტექტივის შემდეგ მეორე ღამიდან იღვიძებს სერიული მკვლელი, რომელიც დამოუკიდებელი როლია. მისი მიზანია, დარჩეს თამაშის ბოლომდე და აქვს სულ 2 მკვლელობის უფლება. გასროლა სავალდებულო არაა.

👩🏻‍⚕️ ყველაზე ბოლოს, ყოველ ღამე იღვიძებს ექიმი და ცდილობს, გადაარჩინოს რომელიმე მოქალაქე. თითოეული მოქალაქისა და საკუთარი თავის გადარჩენა ექიმს მხოლოდ ერთხელ შეუძლია.

თამაშში არსებულ ნებისმიერ როლს შეუძლია ნებისმიერი სხვა როლის დაბრალება.

მოქალაქეები ღამის გარდა დღეც ტოვებენ თამაშს, ამჯერად ხმის მიცემით.

დღის განმავლობაში თერთმეტივე მოთამაშის ამოცანაა, ქალაქს დააჯეროს საკუთარი “პატიოსნება” და დარჩეს თამაშის ბოლომდე. 

თითოეულ მოქალაქეს რიგითობის მიხედვით ეძლევა ზუსტად 1 წუთი სასაუბროდ და, სურვილის შემთხვევაში, კანდიდატურის დასასახელებლად. კანდიდატებად დასახელებულ მოთამაშეებს დამატებით 30 წამი ეძლევათ თავის დასაცავად. ამის შემდეგ ქალაქი უმრავლესობის პრინციპით ირჩევს, ვინ დატოვებს თამაშს.

ხმის მიცემისას თავის შეკავების შემთხვევაში, ხმა ავტომატურად გადადის ბოლო კანდიდატზე. 

თუ მოქალაქეები დააგროვებენ ხმების თანაბარ რაოდენობას, მათ კიდევ დამატებით 30-30 წამი ეძლევათ არგუმენტაციისთვის, რის შემდეგაც ხდება საბოლოო კენჭისყრა და ის კანდიდატი, რომელიც დააგროვებს ხმათა უმრავლესობას, დატოვებს თამაშს. განმეორებითი ხმის მიცემა მხოლოდ იმ კანდიდატებს შორის ტარდება, ვინც ყველაზე მეტი თანაბარი რაოდენობის ხმა დააგროვა.

განმეორებითი ხმის მიცემის შემდეგ, თუ კანდიდატებმა კვლავ თანაბარი რაოდენობის ხმები დააგროვეს, გამოდის ახალი შეკითხვა, სურს თუ არა ქალაქს ყველა კანდიდატს დაატოვებინოს თამაში.

მაფია იგებს იმ შემთხვევაში, თუ თამაშში თანაბარი რაოდენობით დარჩებიან მოქალაქეებთან: 3x3, 2x2, 1x1.

მანიაკი იგებს იმ შემთხვევაში, თუ 1x1-ზე დარჩება მოთამაშეებთან.

პატიოსნები კი იმ შემთხვევაში თუ თამაშიდან გაიყვანენ მაფიოზებს და მანიაკს.`

export const landingTexts = {'play' : "/",  'Rating' : 'rating', 'Registration': "signUp"}

export const noUserImage = noUserPhoto.src